Delapan_APRIL/app/Controllers/Peserta.php

SELECT *
FROM "provinsi"
ORDER BY "nama_provinsi" ASC
---
    public function index() {
        $db = \Config\Database::connect();
        $data = [
            'peserta'  => $this->pesertaModel->getPesertaLengkap(),
            'provinsi' => $db->table('provinsi')->orderBy('nama_provinsi', 'ASC')->get()->getResultArray()

SELECT *
FROM "kabkot"
WHERE "provinsi_id" = '16'
ORDER BY "nama_kabkot" ASC
---
    public function get_kabkota() {
        $id_prov = $this->request->getPost('id_prov');
        $db = \Config\Database::connect();
        $results = $db->table('kabkot')->where('provinsi_id', $id_prov)->orderBy('nama_kabkot', 'ASC')->get()->getResultArray();