app/Models/PesertaModel.php

SELECT "peserta".*, "provinsi"."nama_provinsi", "kabkot"."nama_kabkot"
FROM "peserta"
LEFT JOIN "provinsi" ON "provinsi"."id" = "peserta"."provinsi_id"
LEFT JOIN "kabkot" ON "kabkot"."id" = "peserta"."kabkot_id"
ORDER BY "peserta"."id" DESC
---
    public function getPesertaLengkap()
    {
        return $this->select('peserta.*, provinsi.nama_provinsi, kabkot.nama_kabkot')
                    ->join('provinsi', 'provinsi.id = peserta.provinsi_id', 'left')
                    ->join('kabkot', 'kabkot.id = peserta.kabkot_id', 'left')
                    ->orderBy('peserta.id', 'DESC')
                    ->findAll();